Project/Toir/src/Catalogs/торо_Комиссии/торо_Комиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_Комиссии</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Председатель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставКомиссии</name>
    <attributes>
      <name>ЧленКомиссии</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_Комиссии/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	МассивСтрок = СоставКомиссии.НайтиСтроки(Новый Структура("ЧленКомиссии", Председатель));
	
	Если МассивСтрок.Количество() > 0 Тогда
		ТекстСообщения = НСтр("es='El empleado no puede ser el presidente y el miembro de la comisión al mismo tiempo';ru='Сотрудник не может быть председателем и членом комиссии одновременно';en='An employee cannot be the chairman and member of the commission at the same time.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Председатель",, Отказ);
	КонецЕсли;
	
	ВспомТЗ = СоставКомиссии.Выгрузить();
	ВспомТЗ.Колонки.Добавить("Количество");
	ВспомТЗ.ЗаполнитьЗначения(1, "Количество");
	ВспомТЗ.Свернуть("ЧленКомиссии", "Количество");
	
	Для каждого Строка Из ВспомТЗ Цикл
		Если Строка.Количество > 1 Тогда
			
			МассивСтрок = СоставКомиссии.НайтиСтроки(Новый Структура("ЧленКомиссии", Строка.ЧленКомиссии));
			НомераСтрок = "";
			
			Для каждого СтрокаДляНомера Из МассивСтрок Цикл
				НомераСтрок = НомераСтрок + ", " + СтрокаДляНомера.НомерСтроки;
			КонецЦикла;
			
			НомераСтрок = Сред(НомераСтрок, 3, СтрДлина(НомераСтрок));
			
			ШаблонСообщения = НСтр("es='El empleado %1 es indicado como parte de los miembros de la comisión en las líneas %2';ru='Сотрудник %1 указан в составе членов комиссии в строках %2';en='Employee%1 is indicated in the composition of the members of the commission in lines%2'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.ЧленКомиссии, НомераСтрок);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры
#КонецОбласти
